#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_compute_network.vpc_network: Refreshing state... [id=projects/builds-334818/global/networks/dev-network]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/builds-334818/regions/us-west1/subnetworks/subnet-a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_subnetwork.subnet must be replaced
-/+ resource "google_compute_subnetwork" "subnet" {
      ~ creation_timestamp         = "2022-04-07T13:08:04.417-07:00" -> (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      ~ gateway_address            = "10.2.0.1" -> (known after apply)
      ~ id                         = "projects/builds-334818/regions/us-west1/subnetworks/subnet-a" -> (known after apply)
      ~ ip_cidr_range              = "10.2.0.0/16" -> "10.1.0.0/16" # forces replacement
      + ipv6_cidr_range            = (known after apply)
        name                       = "subnet-a"
      ~ network                    = "https://www.googleapis.com/compute/v1/projects/builds-334818/global/networks/dev-network" -> "projects/builds-334818/global/networks/dev-network"
      ~ private_ip_google_access   = false -> true
      ~ private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> (known after apply)
      ~ project                    = "builds-334818" -> (known after apply)
      ~ purpose                    = "PRIVATE" -> (known after apply)
      ~ region                     = "us-west1" -> (known after apply)
      ~ secondary_ip_range         = [] -> (known after apply)
      ~ self_link                  = "https://www.googleapis.com/compute/v1/projects/builds-334818/regions/us-west1/subnetworks/subnet-a" -> (known after apply)
      ~ stack_type                 = "IPV4_ONLY" -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

#### Checkov Results :mag_right:`success`

<details><summary>Show Checkov Results</summary>

```


       _               _              
   ___| |__   ___  ___| | _______   __
  / __| '_ \ / _ \/ __| |/ / _ \ \ / /
 | (__| | | |  __/ (__|   < (_) \ V / 
  \___|_| |_|\___|\___|_|\_\___/ \_/  
                                      
By bridgecrew.io | version: 2.0.1047 
terraform scan results:

Passed checks: 1, Failed checks: 2, Skipped checks: 0

Check: CKV_GCP_74: "Ensure that private_ip_google_access is enabled for Subnet"
	PASSED for resource: google_compute_subnetwork.subnet
	File: /main.tf:6-11
Check: CKV_GCP_76: "Ensure that Private google access is enabled for IPV6"
	FAILED for resource: google_compute_subnetwork.subnet
	File: /main.tf:6-11

		6  | resource "google_compute_subnetwork" "subnet" {
		7  |   name                     = "subnet-a"
		8  |   ip_cidr_range            = "10.1.0.0/16"
		9  |   network                  = google_compute_network.vpc_network.id
		10 |   private_ip_google_access = true
		11 | }

Check: CKV_GCP_26: "Ensure that VPC Flow Logs is enabled for every subnet in a VPC Network"
	FAILED for resource: google_compute_subnetwork.subnet
	File: /main.tf:6-11
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_logging_1

		6  | resource "google_compute_subnetwork" "subnet" {
		7  |   name                     = "subnet-a"
		8  |   ip_cidr_range            = "10.1.0.0/16"
		9  |   network                  = google_compute_network.vpc_network.id
		10 |   private_ip_google_access = true
		11 | }



Wrote output in SARIF format to the file 'results.sarif'
```

</details>

*Pusher: @choste, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*